{
    "productData": {
        "product_id": "p10000117",
        "displayName": "OKRA tablet Car Cup holder",
        "productImageURL": "http://182.72.15.237/assets/PDPImages/Car-cup-holder (1).jpg",
		"category":"Tablets",
		"brand":"OKRA",
        "thumbnailImages": [
            "http://182.72.15.237/assets/PDPImages/Car-cup-holder (1).jpg",
            "http://182.72.15.237/assets/PDPImages/Car-cup-holder (2).jpg",
            "http://182.72.15.237/assets/PDPImages/Car-cup-holder (3).jpg"
        ],
        "shortDescription": "Boasting a long-lasting battery, the Dolby Atmos technology and a 20.32 cm (8) HD display, there’s never a dull moment with the Lenovo Tab 4 8. Powered by a Qualcomm Snapdragon 64-bit quad-core processor, along with 2 GB of RAM, this tablet offers smooth and fast multitasking. Store many videos, songs and e-books on the 16 GB of internal memory.",
        "longDescription": "<div data-locator=\"pdp-productlongdescriptiontext\" class=\"LongDescription_6sLdpf mt2\"><ul> <li>Universal Cup Holder 2 in 1 Device Holder - Adjustable Grip Guaranteed to work with all Smartphones and Tablets, Install in seconds with no tools</li> <li>The base adjusts to fit firmly in all vehicles, cars, SUV, RV, trucks and other cup holders, with easy fingertip access to your device when on the road</li> <li>Flexible neck with a 360-degree multi-angle swivel positioning, ideal for any viewing angle and any road condition</li> <li>Perfect for both driver and passenger - allows for Handsfree visible navigation and access to Play Music, Google Maps, Driving Directions, Traffic Navigation Apps and more</li> <li>100% Lifetime Satisfaction Guaranteed! If you EVER have any issue with this product we will replace it for free or issue you a full refund!</li> <li>1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories</li></ul></div>",
        "salePrice": "",
        "listPrice": 10.99,
        "discountPercent": "50",
        "availableQuantity" : 10,
        "reviewStars": 4.4,
        "totalReviews": 99,
         "swatches": {
    

  }
    
    }
}